first_blog/app/controllers/blogs_controller.rb

  def create
    @author = Author.create(name: params[:author][:name])
    @blog = Blog.create(title: params[:blog][:title], description: params[:blog][:description], author_id: @author.id)
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Author McAuthorpants"], ["created_at", "2015-06-08 04:55:41.343213"], ["updated_at", "2015-06-08 04:55:41.343213"]]
INSERT INTO "blogs" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Second Blog"], ["description", "See if author index updates."], ["author_id", 2], ["created_at", "2015-06-08 04:58:44.345701"], ["updated_at", "2015-06-08 04:58:44.345701"]]