first_blog/app/controllers/posts_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @post = Post.new
    @blog = Blog.find(params[:blog_id])
    @author = Author.find(params[:author_id])

INSERT INTO "posts" ("title", "description", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First Post"], ["description", "Trying a post."], ["blog_id", 1], ["created_at", "2015-06-08 05:36:48.557325"], ["updated_at", "2015-06-08 05:36:48.557325"]]
---
  def create
    @post = Post.create(title: params[:post][:title], description: params[:post][:description], blog_id: params[:blog_id])