todo_mvc_v2/app/views/todos/index.html.erb

          <!-- This should be `0 items left` by default -->
          <span id="todo-count"><strong><%= @todos.where(complete: false).count %></strong> items left</span>
---
SELECT "todos".* FROM "todos" WHERE "todos"."complete" = 'f'
SELECT COUNT(*) FROM "todos" WHERE "todos"."complete" = 'f' AND "todos"."complete" = 'f'