todo_mvc_v2/app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
    @todos_left = Todo.where(complete: false).count
---
SELECT "todos".* FROM "todos"
SELECT COUNT(*) FROM "todos" WHERE "todos"."complete" = 'f'

  def create
    #params = params[:title].strip!
    todo = Todo.create(title: params[:title])
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Try again"], ["created_at", "2015-06-03 18:17:33.819201"], ["updated_at", "2015-06-03 18:17:33.819201"]]

  def edit
    todo = Todo.find(params[:id])
    todo.editing = true
    @todos = Todo.all
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 2]]
SELECT "todos".* FROM "todos"

  def destroy
    Todo.find(params[:id]).destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]

  def toggle
    @todos = Todo.all
    @todos_left = Todo.where(complete: false).count
    if @todos.all_completed?
      @todos.update_all(complete: false)
---
SELECT "todos".* FROM "todos"
SELECT COUNT(*) FROM "todos" WHERE "todos"."complete" = 'f'
UPDATE "todos" SET "complete" = 't'

  def toggle_one
    Todo.find(params[:id]).toggle!(:complete)
    @todos = Todo.all
    @todos_left = Todo.where(complete: false).count
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "todos" SET "complete" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["complete", "t"], ["updated_at", "2015-06-03 18:18:44.184153"], ["id", 1]]
SELECT "todos".* FROM "todos"
SELECT COUNT(*) FROM "todos" WHERE "todos"."complete" = 'f'

  def active
    @todos_left = Todo.where(complete: false).count
    @todos = Todo.where(complete: false)
---
SELECT COUNT(*) FROM "todos" WHERE "todos"."complete" = 'f' AND "todos"."complete" = 'f'
SELECT "todos".* FROM "todos" WHERE "todos"."complete" = 'f'

  def completed
    @todos_left = Todo.where(complete: false).count
    @todos = Todo.where(complete: true)
---
SELECT COUNT(*) FROM "todos" WHERE "todos"."complete" = 't'
SELECT "todos".* FROM "todos" WHERE "todos"."complete" = 't'

  def clear_completed
    @todos = Todo.destroy_all(complete: true)
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]