todo_mvc_v2/app/controllers/todos_controller.rb

SELECT COUNT(*) FROM "todos"
---
  def index
    @todos = Todo.all
    @todos_count = Todo.count

SELECT "todos".* FROM "todos" WHERE "todos"."complete" = 't'
SELECT COUNT(*) FROM "todos"
---
  def clear_completed
    @todos = Todo.where(complete: true).destroy_all
    @todos_render = Todo.count