ermahgerd_berlberser/app/controllers/pokemons_controller.rb

  def show
    @pokemon = Ermahgerd.find(params[:id])
---
SELECT  "ermahgerds".* FROM "ermahgerds" WHERE "ermahgerds"."id" = ? LIMIT 1  [["id", 2]]