ermahgerd_berlberser/app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemons = Pokemon.all

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @pokemon = Pokemon.find(params[:id])